def area(a, b):
    """
    Вычисляет площадь прямоугольника по его ширине и высоте.

    Параметры:
    a (float): Ширина прямоугольника.
    b (float): Высота прямоугольника.

    Возвращает:
    float: Площадь прямоугольника.

    Пример вызова:
    >>> area(4, 5)
    20
    """
    return a * b

def perimeter(a, b):
"""
    Вычисляет периметр прямоугольника по его ширине и высоте.

    Параметры:
    a (float): Ширина прямоугольника.
    b (float): Высота прямоугольника.

    Возвращает:
    float: Периметр прямоугольника.

    Пример вызова:
    >>> perimeter(4, 5)
    18
    """
    return (a + b)*2
